Revit 2027 API
SizingCalculator.Velocity Method
 Calculates the velocity based on the specified parameters.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Velocity(
	double flow,
	SizingOptions options
)
Public Function Velocity (
	flow As Double,
	options As SizingOptions
) As Double
public:
double Velocity(
	double flow,
	SizingOptions^ options
)
member Velocity :
        flow : float *
        options : SizingOptions -> float
Parameters
flow Double
 The flow rate.
options SizingOptions
 The sizing options containing other input parameters (such as profile type and size).
Return Value
Double
 Returns the calculated velocity.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SizingCalculator Class
Autodesk.Revit.DB.Analysis Namespace